
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Создать(Команда)
	
	//Запуск фонового задания на сервере.  
	ДлительнаяОперация = НачатьВыполнениеДлительнойОперации();
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	ПараметрыОжидания.Интервал = 1;
	ДлительныеОперацииКлиент.ОжидатьЗавершение(
			ДлительнаяОперация,
			Новый ОписаниеОповещения("ВыполнениеДлительнойПроцедурыЗавершение",ЭтотОбъект),ПараметрыОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоДоговорам(Команда)
	ЗаполнитьПоДоговорамНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//&НаСервере
//Функция ВыполнитьФоновоеЗаданиеНаСервере(ПараметрыЗапуска, УникальныйИдентификатор)
	
//	НаименованиеЗадания = "Моя длительная операции";

//	ВыполняемыйМетод = "Документы.";
	
//	ПараметрыВыполнения 	= ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
//	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НаименованиеЗадания;
//	ПараметрыВыполнения.ЗапуститьВФоне 	= Истина;
//	ПараметрыВыполнения.Вставить("ИдентификаторФормы", УникальныйИдентификатор); 
	
//	СтруктураФоновогоЗадания = ДлительныеОперации.ВыполнитьВФоне(ВыполняемыйМетод, ПараметрыЗапуска, ПараметрыВыполнения);
	
//	Возврат СтруктураФоновогоЗадания;
	
//КонецФункции

&НаСервере
Функция НачатьВыполнениеДлительнойОперации()
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = Нстр("ru = 'Получение сложных данных'");
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Период",Объект.Период);
	СтруктураДанных.Вставить("МассивДоговоров",Объект.СозданныеДокументы.Выгрузить().ВыгрузитьКолонку("Договор"));
	Возврат ДлительныеОперации.ВыполнитьФункцию(УникальныйИдентификатор,"Обработки.ВКМ_МассовоеСозданиеАктов.СоздатьНаРеализации",СтруктураДанных);
	
КонецФункции 

&НаКлиенте
Процедура ВыполнениеДлительнойПроцедурыЗавершение(Результат, ДополнительныеПараметры) Экспорт
 
	Если Результат = Неопределено Тогда      
		 Возврат;
 	КонецЕсли; 
	
 	Если Результат.Статус = "Ошибка" Тогда
  		ПоказатьПредупреждение(,Результат.КраткоеПредставлениеОшибки);
	Иначе
		ДлительныеОперацииЗавершениеНаСервере(Результат.АдресРезультата);
		УдалитьИзВременногоХранилища(Результат.АдресРезультата);
	КонецЕсли;
	
КонецПроцедуры
 
&НаСервере
Процедура ДлительныеОперацииЗавершениеНаСервере(АдресХранилища)
	
	Результат = ПолучитьИзВременногоХранилища(АдресХранилища); 
	Объект.СозданныеДокументы.Загрузить(Результат);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоДоговорамНаСервере()  
	
	Объект.СозданныеДокументы.Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка Как Договор
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.АбоненскоеОбслуживание)
	|	И НЕ ДоговорыКонтрагентов.ПометкаУдаления"; 
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		 Стр = Объект.СозданныеДокументы.Добавить();
		 ЗаполнитьЗначенияСвойств(Стр,Выборка);
	 КонецЦикла;	
	 
КонецПроцедуры

#КонецОбласти