
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьПоВзаиморасчетам(Команда)
	
	Если Объект.ВКМ_ПериодРегистрации = '00010101' Тогда
		ТекстСообщения = "Укажите период регистрации";
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "ВКМ_ПериодРегистрации", "Объект");
		Возврат;
	КонецЕсли;

	ЗаполнитьПоВзаиморасчетамНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьПоВзаиморасчетамНаСервере()
	
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	ДокОбъект.ЗаполнитьПоОстаткамРегистраВзаиморасчетов();
	ЗначениеВРеквизитФормы(ДокОбъект, "Объект");
	
КонецПроцедуры

#КонецОбласти
