
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	СформироватьДвижения();
	СформироватьОсновныеНачисления();
	РассчитатьОсновныеНачисления();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СформироватьДвижения()
	
	Для Каждого Строка Из ВКМ_ОсновныеНачисления Цикл
		Движение = Движения.ВКМ_ОсновныеНачисления.Добавить();
		Движение.ПериодРегистрации = ВКМ_ПериодРегистрации;
		Движение.ВКМ_Подразделение = Строка.ВКМ_Подразделение;
		Движение.ВКМ_Сотрудник = Строка.ВКМ_Сотрудник;
		Движение.ВидРасчета = Строка.ВКМ_ВидРасчета;
		Движение.ПериодДействияНачало = Строка.ВКМ_ДатаНачала;
		Движение.ПериодДействияКонец = Строка.ВКМ_ДатаОкончания;
		Движение.ВКМ_Размер = Строка.ВКМ_Размер;
	КонецЦикла;
	
	Движения.ВКМ_ОсновныеНачисления.Записать();
		
КонецПроцедуры

Процедура СформироватьОсновныеНачисления()
	
	ДобавитьЗаписиПоОкладу();
	
	//ДобавитьЗаписиПоОтпускам();
	
	Движения.ВКМ_ОсновныеНачисления.Записать();
	
КонецПроцедуры

Процедура ДобавитьЗаписиПоОкладу()
	
	Отбор = Новый Структура;
	Отбор.Вставить("ВКМ_ВидРасчета", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад);
	
	НайденныеСтроки = ВКМ_ОсновныеНачисления.НайтиСтроки(Отбор);
	Если Не ЗначениеЗаполнено(НайденныеСтроки) Тогда
		Возврат;
	КонецЕсли;
	
	ДатаНачалаОклада = НачалоМесяца(ВКМ_ОсновныеНачисления[0].ДатаНачала);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВКМ_ОсновныеНачисленияЗарплата.ВКМ_Сотрудник КАК ВКМ_Сотрудник,
	|	ВКМ_ОсновныеНачисленияЗарплата.ВКМ_Подразделение КАК ВКМ_Подразделение,
	|	ВКМ_ОсновныеНачисленияЗарплата.ВКМ_ВидРасчета КАК ВКМ_ВидРасчета,
	|	ВКМ_ОсновныеНачисленияЗарплата.ВКМ_ДатаНачала КАК ВКМ_ДатаНачала,
	|	ВКМ_ОсновныеНачисленияЗарплата.ВКМ_ДатаОкончания КАК ВКМ_ДатаОкончания
	|ПОМЕСТИТЬ ВТ_ДанныеДокумента
	|ИЗ
	|	Документ.ВКМ_НачисленияЗарплаты.ВКМ_ОсновныеНачисления КАК ВКМ_ОсновныеНачисленияЗарплата
	|ГДЕ
	|	ВКМ_ОсновныеНачисленияЗарплата.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Период КАК Период,
	|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ВКМ_Сотрудник КАК ВКМ_Сотрудник,
	|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ВКМ_Оклад КАК ВКМ_Оклад
	|ПОМЕСТИТЬ ВТ_ДанныеОкладов
	|ИЗ
	|	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&НачалоПериода, ВКМ_Сотрудник В
	|		(ВЫБРАТЬ
	|			ВТ_ДанныеДокумента.ВКМ_Сотрудник КАК ВКМ_Сотрудник
	|		ИЗ
	|			ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента)) КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеДокумента.ВКМ_Сотрудник КАК ВКМ_Сотрудник,
	|	ВТ_ДанныеДокумента.ВКМ_Подразделение КАК ВКМ_Подразделение,
	|	ВТ_ДанныеДокумента.ВКМ_ВидРасчета КАК ВКМ_ВидРасчета,
	|	ВТ_ДанныеДокумента.ВКМ_ДатаНачала КАК ВКМ_ДатаНачала,
	|	ВТ_ДанныеДокумента.ВКМ_ДатаОкончания КАК ВКМ_ДатаОкончания,
	|	ЕстьNULL(ВТ_ДанныеОкладов.ВКМ_Оклад, 0) КАК ВКМ_Оклад
	|ИЗ
	|	ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеОкладов КАК ВТ_ДанныеОкладов
	|		ПО ВТ_ДанныеДокумента.ВКМ_Сотрудник = ВТ_ДанныеОкладов.ВКМ_Сотрудник";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("НачалоПериода", ДатаНачалаОклада);
		
КонецПроцедуры

Процедура РассчитатьОсновныеНачисления()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВКМ_ОсновныеНачисленияДанныеГрафика.НомерСтроки,
	|	ЕстьNULL(ВКМ_ОсновныеНачисленияДанныеГрафика.ВКМ_ЗначениеФактическийПериодДействия, 0) КАК Факт
	|ИЗ
	|	РегистрРасчета.ВКМ_ОсновныеНачисления.ДанныеГрафика(Регистратор = &Регистратор) КАК
	|		ВКМ_ОсновныеНачисленияДанныеГрафика";
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Движение = Движения.ВКМ_ОсновныеНачисления[ВыборкаДетальныеЗаписи.НомерСтроки - 1];
		Движение.ВКМ_Результат = Движение.ВКМ_Размер * ВыборкаДетальныеЗаписи.Факт;
	КонецЦикла;
	
	Движения.ВКМ_ОсновныеНачисления.Записать(, Истина)
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли