#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//AS
	СформироватьДиаграммуГанта();
	//AS

КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура СформироватьДиаграммуГанта()
	//AS
	//Запрос = Новый Запрос;
	//Запрос.Текст =
	//	"ВЫБРАТЬ
	//	|	ВКМ_ГрафикОтпусковВКМ_ОтпускаСотрудников.ВКМ_Сотрудник,
	//	|	ВКМ_ГрафикОтпусковВКМ_ОтпускаСотрудников.ВКМ_ДатаНачала,
	//	|	ВКМ_ГрафикОтпусковВКМ_ОтпускаСотрудников.ВКМ_ДатаОкончания
	//	|ИЗ
	//	|	Документ.ВКМ_ГрафикОтпусков.ВКМ_ОтпускаСотрудников КАК ВКМ_ГрафикОтпусковВКМ_ОтпускаСотрудников
	//	|ГДЕ
	//	|	ВКМ_ГрафикОтпусковВКМ_ОтпускаСотрудников.Ссылка = &Ссылка";
	//
	//Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка); 
	ТаблицаОтпусков = ПолучитьИзВременногоХранилища(Параметры.АдресВх);
	
	//РезультатЗапроса = Запрос.Выполнить();
	Серия = ДиаграммаГанта.УстановитьСерию("Отпуска");
//	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Для Каждого ВыборкаДетальныеЗаписи Из ТаблицаОтпусков Цикл
		Точка = ДиаграммаГанта.УстановитьТочку(ВыборкаДетальныеЗаписи.ВКМ_Сотрудник);
		Значение = ДиаграммаГанта.ПолучитьЗначение(Точка,Серия);
		//Значение.Данные.Сотрудник  = ВыборкаДетальныеЗаписи.ВКМ_Сотрудник;
		Интервал = Значение.Добавить();
		Интервал.Начало = ВыборкаДетальныеЗаписи.ВКМ_ДатаНачала;
		Интервал.Конец = ВыборкаДетальныеЗаписи.ВКМ_ДатаОкончания;
	КонецЦикла;
	
	//AS
КонецПроцедуры	
#КонецОбласти