#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция СоздатьНаРеализации(Параметры) Экспорт
	
	СписокРеализации = РеализацияВЭтомМесяце(Параметры).Выгрузить();
	МассивДокументов = Новый ТаблицаЗначений;  
	МассивДокументов.Колонки.Добавить("Реализация");
	МассивДокументов.Колонки.Добавить("Договор");  
	МассивДокументов.Колонки.Добавить("Ошибка");

	Для Каждого Договор Из Параметры.МассивДоговоров Цикл
		
		Если Договор.ВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.АбоненскоеОбслуживание Тогда
			Продолжить;
		КонецЕсли;
			
		Отбор = Новый Структура();
		Отбор.Вставить("Договор", Договор);
		Стр = МассивДокументов.Добавить();
		Стр.Договор = Договор; 
		СтрокиРеализаций = СписокРеализации.НайтиСтроки(Отбор);
		Если СтрокиРеализаций.Количество() = 0 Тогда
			ДокРеализация = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
			ДокРеализация.Заполнить(Неопределено);
			ДокРеализация.Дата = Параметры.Период;
			ДокРеализация.Договор = Договор;
			ДокРеализация.Контрагент = Договор.Владелец;
			ДокРеализация.ВыполнитьАвтозаполнение();
			Если ДокРеализация.Услуги.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			ДокРеализация.Организация = Справочники.Организации.НайтиПоКоду("000000001");
			НетОшибок = ДокРеализация.ПроверитьЗаполнение();
			Если НетОшибок Тогда
				ДокРеализация.Записать(РежимЗаписиДокумента.Проведение);
			Иначе        
				ДокРеализация.Записать();
				ОбщегоНазначения.СообщитьПользователю("Ошибка записи документа. Не заполнены обязательные реквизиты ");  
				Стр.Ошибка = ОписаниеОшибки();
				//Продолжить;
			КонецЕсли;       
			
			Стр.Реализация = ДокРеализация.Ссылка;			
			
		Иначе 
			Стр.Реализация = СтрокиРеализаций[0].Ссылка;
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивДокументов;
	
КонецФункции

Функция РеализацияВЭтомМесяце(Параметры)
	
	Период = Параметры.Период;
	МассивДоговоров = Параметры.МассивДоговоров;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Ссылка КАК Ссылка,
		|	РеализацияТоваровУслуг.Договор КАК Договор
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|	РеализацияТоваровУслуг.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И РеализацияТоваровУслуг.Договор В(&Договора)
		|	И РеализацияТоваровУслуг.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("ДатаНачала", НачалоМесяца(Период));
	Запрос.УстановитьПараметр("ДатаОкончания",  КонецМесяца(Период));
	Запрос.УстановитьПараметр("Договора", МассивДоговоров);
	
	РезультатЗапроса = Запрос.Выполнить();
	
 	Возврат РезультатЗапроса;
	
КонецФункции	

#КонецОбласти

#КонецЕсли