
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
			
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	ДоговорыКонтрагентов.ВКМ_ДатаНачала,
			|	ДоговорыКонтрагентов.ВКМ_ДатаОкончания,
			|	ДоговорыКонтрагентов.ВидДоговора
			|ИЗ
			|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
			|ГДЕ
			|	ДоговорыКонтрагентов.Ссылка = &Договор";
		
		Запрос.УстановитьПараметр("Договор", ВКМ_Договор);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Выборка.Следующий();
		ЭтоАбоненскоеОбслуживание = (Выборка.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.АбоненскоеОбслуживание);
		Если Не (ЭтоАбоненскоеОбслуживание И Дата >= Выборка.ВКМ_ДатаНачала И Дата <= Выборка.ВКМ_ДатаОкончания) Тогда
			Отказ = Истина;
			//Андрей-дурак добавь из БСП сообщение пользователю
		КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли